## Loading data

In [1]:
import sqlite3

In [ ]:
def add_data_to_database():
    try:
        # Connecting to the database
        with sqlite3.connect('students_data.db') as conn:
            cursor = conn.cursor()

            cursor.execute('''
            CREATE TABLE students (
                id PRIMARY KEY,
                name VARCHAR(50),
                birth_year INT,
                marks INT
                )
            ''')
            # Student data to load
            data = [
                    (1,'Alice', 2005, 57),
                    (2, 'Bob', 2005, 67),
                    (3, 'Carol', 2003, 90),
                    (4, 'Imraan', 2006, 88),
                    (5, 'John', 2008, 92),
                    (6, 'Paul', 2007, 55),
                    (7, 'Samuel', 2010, 60),
                    (8, 'Eve', 2011, 77),
                    (9, 'Luke', 2011, 67),
                    (10, 'Ivan', 2012, 70)
            ]
            cursor.executemany(
                '''
                INSERT INTO students(id, name, birth_year, marks) VALUES (?, ?, ?, ?)

                ''', data
            )
            conn.commit()
            print("Table successfully created")
    except sqlite3.Error as e:
        print(f'Error: {e}')

# Calling function
add_data_to_database()

In [3]:
# Loading SQL extension
%load_ext sql

In [4]:
# Connecting to the database
%sql sqlite:///students_data.db

In [5]:
# Default to duplicated style
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

## Question 1: **Answer**

In [6]:
%%sql
SELECT * FROM students;

 * sqlite:///students_data.db
Done.

[(1, 'Alice', 2005, 57),
 (2, 'Bob', 2005, 67),
 (3, 'Carol', 2003, 90),
 (4, 'Imraan', 2006, 88),
 (5, 'John', 2008, 92),
 (6, 'Paul', 2007, 55),
 (7, 'Samuel', 2010, 60),
 (8, 'Eve', 2011, 77),
 (9, 'Luke', 2011, 67),
 (10, 'Ivan', 2012, 70)]

## Question 2: **Answer**

In [7]:
%%sql
SELECT * FROM students
LIMIT  3;

 * sqlite:///students_data.db
Done.

[(1, 'Alice', 2005, 57), (2, 'Bob', 2005, 67), (3, 'Carol', 2003, 90)]

## Question 3: **Answer**

In [8]:
%%sql
SELECT name FROM students;

 * sqlite:///students_data.db
Done.

[('Alice',),
 ('Bob',),
 ('Carol',),
 ('Imraan',),
 ('John',),
 ('Paul',),
 ('Samuel',),
 ('Eve',),
 ('Luke',),
 ('Ivan',)]